[M_KillSnowman MissionDefinition]
MissionName="Cold as snow"
MissionDescription="influence wants to check you out [place]To begin[-place], A snowy mountain town awaits your luggage.."
TurnInDescription="find the objects Kill the evil snowman and save the city. Now about the scene..."
MissionSummary="Delivery service [place]Gingerton[-place]. Except for citizens!"
MissionGiver="Marcus"
MissionTurnInLocation="Below average for the team"
TeaserText="Let's make a miracle happen on Labor Day!!"

[M_KillSnowman:DefendTrain MissionObjectiveDefinition]
ProgressMessage="Follow the train."

[M_KillSnowman:DumpCoal MissionObjectiveDefinition]
ProgressMessage="Pour coal into the pan."

[M_KillSnowman:EscortTrain MissionObjectiveDefinition]
ProgressMessage="Take the train to the city."

[M_KillSnowman:FixBridge MissionObjectiveDefinition]
ProgressMessage="The foundations of the bridge remained."

[M_KillSnowman:FollowTracks MissionObjectiveDefinition]
ProgressMessage="look for a train"

[M_KillSnowman:GoToGingerton MissionObjectiveDefinition]
ProgressMessage="Return to Gingerton's page"

[M_KillSnowman:Ignitefurnace MissionObjectiveDefinition]
ProgressMessage="Turn on the boiler"

[M_KillSnowman:InvestigateFurnace MissionObjectiveDefinition]
ProgressMessage="Look at the pot"

[M_KillSnowman:KillBandits MissionObjectiveDefinition]
ProgressMessage="Kill the thief"

[M_KillSnowman:KillSnowman MissionObjectiveDefinition]
ProgressMessage="beat the police"

[M_KillSnowman:KillSnowmenMinions MissionObjectiveDefinition]
ProgressMessage="Kill the snowman"

[M_KillSnowman:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_DefendTrain MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_DumpCoal MissionObjectiveSetDefinition]
MissionSummaryOverride="Fill the pot with coal. "
MissionDescriptionOverride="The train has arrived. Add charcoal to pan.."

[M_KillSnowman:ObjSet_EscortTrain1 MissionObjectiveSetDefinition]
MissionSummaryOverride="Take the train to the city.."
MissionDescriptionOverride="You saw a ship. Check it out when you're back in town.."

[M_KillSnowman:ObjSet_EscortTrain2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_FixBridge MissionObjectiveSetDefinition]
MissionSummaryOverride="Bridge maintenance."
MissionDescriptionOverride="Paul's ribs were frozen and he broke the ice to take the train back to the city."

[M_KillSnowman:ObjSet_FollowTracks MissionObjectiveSetDefinition]
MissionSummaryOverride="find a train."
MissionDescriptionOverride="Goods and coal did not arrive. Follow the instructions until you figure out what happened."

[M_KillSnowman:ObjSet_GoToGingerton MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_InvestigateFurnace MissionObjectiveSetDefinition]
MissionSummaryOverride="Check out the city sauce.."
MissionDescriptionOverride="The city froze. Marcus wants you to find the city treasury and find out what happened.."

[M_KillSnowman:ObjSet_KillBandits MissionObjectiveSetDefinition]
MissionSummaryOverride="Kill the thief. "
MissionDescriptionOverride="There are thieves on the train who want to rob you! fill these out!"

[M_KillSnowman:ObjSet_KillBandits_FailedOptional MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_KillSnowman MissionObjectiveSetDefinition]
MissionSummaryOverride="walk in the storm."
MissionDescriptionOverride="Mr. Loss Save the day from evil cobblers and salesmen. [place]ginger[-place]."

[M_KillSnowman:ObjSet_KillSnowmen MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_OpenShipment MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_SearchForCoal MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_SignalTrain MissionObjectiveSetDefinition]
MissionSummaryOverride="Train sign."
MissionDescriptionOverride="The bridge is ready! Call a train and come back. [place]Reyesley[-place]."

[M_KillSnowman:ObjSet_SummonSnowman MissionObjectiveSetDefinition]
MissionSummaryOverride="A lesson to stay away from evil.."
MissionDescriptionOverride="Play music with village bells. we fight the boss!"

[M_KillSnowman:ObjSet_TakeOffHat MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_TalkToMarcus MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_KillSnowman:ObjSet_TalkToTim MissionObjectiveSetDefinition]
MissionSummaryOverride="Timo's report."
MissionDescriptionOverride="The city melted. Talk to Tim. He is shorter than average.."

[M_KillSnowman:ObjSet_TurnOnFurnace MissionObjectiveSetDefinition]
MissionSummaryOverride="Turn on the boiler. "
MissionDescriptionOverride="The pot is full of coal. TOMORROW!"

[M_KillSnowman:OpenShipment MissionObjectiveDefinition]
ProgressMessage="open gun"

[M_KillSnowman:PreventTrainTheft MissionObjectiveDefinition]
ProgressMessage="Theft of a coach car"

[M_KillSnowman:SearchForCoal MissionObjectiveDefinition]
ProgressMessage="Coal"

[M_KillSnowman:SummonSnowman MissionObjectiveDefinition]
ProgressMessage="Contact Mr. cup"

[M_KillSnowman:TakeOffHat MissionObjectiveDefinition]
ProgressMessage="Bring a snow hat"

[M_KillSnowman:TalkToConductor MissionObjectiveDefinition]
ProgressMessage="Wonders are a guide"

[M_KillSnowman:TalkToMarcus MissionObjectiveDefinition]
ProgressMessage="Talk to Marco"

[M_KillSnowman:TalkToTim MissionObjectiveDefinition]
ProgressMessage="Talk to a team that's not normal"

[M_KillSnowman:TurnOnFurnace MissionObjectiveDefinition]
ProgressMessage="Close the boiler door"

